# Pandas 高级

## 1.数据筛选

### 1.1 赋值操作

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randint(0, 50, size=(20, 3)), columns=['Python', 'Java', 'PHP'])
df

    Python  Java  PHP
0       19    25   37
1       48    37   21
2       30     2   42
3       26    29    8
4       15    36   12
5       27    15   42
6       12    32    9
7       24    37   20
8       45    22    3
9       31    23    8
10       4     1   48
11      35     3   44
12      16    17    5
13      18    36   38
14      38    39    7
15      40    26   45
16      35    17   41
17       8    27   35
18      30    36   26
19      40    45   17

In [3]:
# 增加列
df['物理'] = np.random.randint(0, 50, size=20)
df

    Python  Java  PHP  物理
0       19    25   37  36
1       48    37   21  22
2       30     2   42  23
3       26    29    8   0
4       15    36   12   8
5       27    15   42  45
6       12    32    9  31
7       24    37   20  10
8       45    22    3  33
9       31    23    8  22
10       4     1   48   1
11      35     3   44  26
12      16    17    5  10
13      18    36   38  10
14      38    39    7  34
15      40    26   45  13
16      35    17   41  45
17       8    27   35   6
18      30    36   26  25
19      40    45   17  12

In [4]:
# 所有都增加10分
df.Python += 10
df

    Python  Java  PHP  物理
0       29    25   37  36
1       58    37   21  22
2       40     2   42  23
3       36    29    8   0
4       25    36   12   8
5       37    15   42  45
6       22    32    9  31
7       34    37   20  10
8       55    22    3  33
9       41    23    8  22
10      14     1   48   1
11      45     3   44  26
12      26    17    5  10
13      28    36   38  10
14      48    39    7  34
15      50    26   45  13
16      45    17   41  45
17      18    27   35   6
18      40    36   26  25
19      50    45   17  12

In [5]:
# 给指定的索引赋值
df.Java[[2, 3]] = 100
df

    Python  Java  PHP  物理
0       29    25   37  36
1       58    37   21  22
2       40   100   42  23
3       36   100    8   0
4       25    36   12   8
5       37    15   42  45
6       22    32    9  31
7       34    37   20  10
8       55    22    3  33
9       41    23    8  22
10      14     1   48   1
11      45     3   44  26
12      26    17    5  10
13      28    36   38  10
14      48    39    7  34
15      50    26   45  13
16      45    17   41  45
17      18    27   35   6
18      40    36   26  25
19      50    45   17  12

In [6]:
# 跨维度修改数据
df.loc[[2, 3], ['Python', 'Java']] = 100
df

    Python  Java  PHP  物理
0       29    25   37  36
1       58    37   21  22
2      100   100   42  23
3      100   100    8   0
4       25    36   12   8
5       37    15   42  45
6       22    32    9  31
7       34    37   20  10
8       55    22    3  33
9       41    23    8  22
10      14     1   48   1
11      45     3   44  26
12      26    17    5  10
13      28    36   38  10
14      48    39    7  34
15      50    26   45  13
16      45    17   41  45
17      18    27   35   6
18      40    36   26  25
19      50    45   17  12

In [7]:
cond = df['物理'] > 20
df[cond] - 100

    Python  Java  PHP  物理
0      -71   -75  -63 -64
1      -42   -63  -79 -78
2        0     0  -58 -77
5      -63   -85  -58 -55
6      -78   -68  -91 -69
8      -45   -78  -97 -67
9      -59   -77  -92 -78
11     -55   -97  -56 -74
14     -52   -61  -93 -66
16     -55   -83  -59 -55
18     -60   -64  -74 -75

In [8]:
df.loc[cond] -= 100
df

    Python  Java  PHP  物理
0      -71   -75  -63 -64
1      -42   -63  -79 -78
2        0     0  -58 -77
3      100   100    8   0
4       25    36   12   8
5      -63   -85  -58 -55
6      -78   -68  -91 -69
7       34    37   20  10
8      -45   -78  -97 -67
9      -59   -77  -92 -78
10      14     1   48   1
11     -55   -97  -56 -74
12      26    17    5  10
13      28    36   38  10
14     -52   -61  -93 -66
15      50    26   45  13
16     -55   -83  -59 -55
17      18    27   35   6
18     -60   -64  -74 -75
19      50    45   17  12

## 2 数据集成

### 2.1 concat

In [9]:
df1 = pd.DataFrame(np.random.randint(0, 150, size=(10, 3)),
                   index=list('ABCDEFGHIJ'),
                   columns=['Python', 'Java', 'PHP'])
df2 = pd.DataFrame(np.random.randint(0, 150, size=(10, 3)),
                   index=list('KLMNOPQRST'),
                   columns=['Python', 'Java', 'PHP'])
df3 = pd.DataFrame(np.random.randint(0, 150, size=(10, 2)),
                   index=list('ABCDEFGHIJ'),
                   columns=['C', 'Kotlin', ])
display(df1, df2, df3)

   Python  Java  PHP
A       0    75   59
B      68    82   87
C     118   120  146
D      80    36   33
E      61    24   20
F      86     3   67
G     149    18   17
H       3    76  143
I      95    70   20
J     112    56  116

   Python  Java  PHP
K      87    86   89
L      69   120   58
M      44    50  136
N      51    69   53
O     105    30   21
P     115     2   37
Q     141   101   64
R     106   124  140
S      66    81  102
T      26    70   72

     C  Kotlin
A  122     144
B   96      90
C   75     140
D   79     143
E   64     123
F   77     102
G  136      57
H   82      52
I   61      28
J  142     114

In [10]:
# 行合并
pd.concat([df1, df2])

   Python  Java  PHP
A       0    75   59
B      68    82   87
C     118   120  146
D      80    36   33
E      61    24   20
F      86     3   67
G     149    18   17
H       3    76  143
I      95    70   20
J     112    56  116
K      87    86   89
L      69   120   58
M      44    50  136
N      51    69   53
O     105    30   21
P     115     2   37
Q     141   101   64
R     106   124  140
S      66    81  102
T      26    70   72

In [11]:
# 列合并
pd.concat([df1, df3], axis=1)

   Python  Java  PHP    C  Kotlin
A       0    75   59  122     144
B      68    82   87   96      90
C     118   120  146   75     140
D      80    36   33   79     143
E      61    24   20   64     123
F      86     3   67   77     102
G     149    18   17  136      57
H       3    76  143   82      52
I      95    70   20   61      28
J     112    56  116  142     114

### 2.2 插入

In [12]:
df = pd.DataFrame(np.random.randint(0, 150, size=(10, 3)),
                  index=list('ABCDEFGHIJ'),
                  columns=['Python', 'Java', 'PHP'])
df

   Python  Java  PHP
A      30    18   43
B      15    61   25
C      93    21  107
D     130   101   75
E      57    37   58
F      38    22  131
G      99    57   90
H       5    14   14
I      82     5  143
J     128    43  130

In [13]:
# 在索引为0的位置插入一列
df.insert(0, 'Kotlin', 100)
df

   Kotlin  Python  Java  PHP
A     100      30    18   43
B     100      15    61   25
C     100      93    21  107
D     100     130   101   75
E     100      57    37   58
F     100      38    22  131
G     100      99    57   90
H     100       5    14   14
I     100      82     5  143
J     100     128    43  130

In [14]:
list(df.columns)

['Kotlin', 'Python', 'Java', 'PHP']

### 2.3 join SQL 风格合并

In [16]:
df1 = pd.DataFrame(data={'name': ['Alice', 'Bob', 'Charlie', 'Daniel'], 'weight': [70, 55, 60, 75]})
df2 = pd.DataFrame(data={'name': ['Alice', 'Bob', 'Charlie', 'Emi'], 'height': [160, 150,175, 166]})
df3 = pd.DataFrame(data={'名字': ['Alice', 'Bob', 'Charlie', 'Emi'], 'height': [160, 150,175, 166]})
display(df1, df2, df3)

      name  weight
0    Alice      70
1      Bob      55
2  Charlie      60
3   Daniel      75

      name  height
0    Alice     160
1      Bob     150
2  Charlie     175
3      Emi     166

        名字  height
0    Alice     160
1      Bob     150
2  Charlie     175
3      Emi     166

In [18]:
df1.merge(df2, on='name', how='inner') # 根据name进行合并，取交集

      name  weight  height
0    Alice      70   160.0
1      Bob      55   150.0
2  Charlie      60   175.0
3   Daniel      75     NaN

In [20]:
df1.merge(df2, on='name', how='outer') # 根据name进行合并，取并集

      name  weight  height
0    Alice    70.0   160.0
1      Bob    55.0   150.0
2  Charlie    60.0   175.0
3   Daniel    75.0     NaN
4      Emi     NaN   166.0

In [21]:
df1.merge(df3, left_on='name',right_on='名字', how='inner') # 根据不同的字段进行合并

      name  weight       名字  height
0    Alice      70    Alice     160
1      Bob      55      Bob     150
2  Charlie      60  Charlie     175

In [24]:
# 创建10名同学的考试成绩
df4 = pd.DataFrame(np.random.randint(0, 100, size=(10, 3)),
                  index=list('ABCDEFGHIJ'),
                  columns=['Python', 'Java', 'PHP'])
df4

   Python  Java  PHP
A      28    90   88
B      20    54   13
C      39    85    8
D      60    14   88
E      12    83   27
F      52    39   98
G      55    92   55
H      93     9   58
I      45    43   65
J      30    85   24

In [31]:
# 求每个同学的平均分
s = df4.mean(axis=1).round(1)
df5 = pd.DataFrame(s, columns=['平均分'])
df5

    平均分
A  68.7
B  29.0
C  44.0
D  54.0
E  40.7
F  63.0
G  67.3
H  53.3
I  51.0
J  46.3

In [34]:
df4.merge(df5, left_index=True, right_index=True, how='inner') # 根据平均分进行合并

   Python  Java  PHP   平均分
A      28    90   88  68.7
B      20    54   13  29.0
C      39    85    8  44.0
D      60    14   88  54.0
E      12    83   27  40.7
F      52    39   98  63.0
G      55    92   55  67.3
H      93     9   58  53.3
I      45    43   65  51.0
J      30    85   24  46.3